# EJERCICIO 3

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///ejercicio3.db

'Connected: None@ejercicio3.db'

Creamos la tabla de Empleados

In [3]:
%%sql 
DROP TABLE IF EXISTS Empleados;
CREATE TABLE Empleados(
    nif VARCHAR(13),
    telefono VARCHAR(15),
    salario INT,
    PRIMARY KEY(nif));

Done.
Done.

[]

Creamos la tabla Departamentos

In [4]:
%%sql
DROP TABLE IF EXISTS Departamentos;
CREATE TABLE Departamentos(
    identificador INT,
    nombre VARCHAR(20),
    presupuesto INT,
    nif VARCHAR(13) NOT NULL,
    PRIMARY KEY (identificador),
    FOREIGN KEY (nif) REFERENCES Empleados(nif));

Done.
Done.

[]

Creamos la tabla Hijos

In [5]:
%%sql
DROP TABLE IF EXISTS Hijos;
CREATE TABLE Hijos(
    nombre VARCHAR(10),
    nif VARCHAR(13) NOT NULL,
    PRIMARY KEY (nombre, nif),
    FOREIGN KEY (nif) REFERENCES Empleados(nif) ON DELETE CASCADE);

Done.
Done.

[]

Creamos la tabla Relacion Trabaja_En

In [6]:
%%sql
DROP TABLE IF EXISTS Trabaja_En;
CREATE TABLE Trabaja_En(
    nif_Empleado VARCHAR(13),
    num_Dpto INT,
    PRIMARY KEY (nif_Empleado,num_Dpto),
    FOREIGN KEY (nif_Empleado) REFERENCES Empleados(nif),
    FOREIGN KEY (num_Dpto) REFERENCES Departamentos(identificador));

Done.
Done.

[]

Vamos a Probar unas inserciones en la tabla
====

In [13]:
%sql INSERT INTO Empleados VALUES('49099522L','606657670',1000);

1 rows affected.

[]

In [14]:
%sql SELECT * FROM Empleados

Done.

[('49099522L', '606657670', 1000)]

In [15]:
%sql PRAGMA foreign_keys = ON;

Done.

[]

In [16]:
%sql SELECT * FROM Hijos

Done.

[]

In [17]:
%sql INSERT INTO Hijos VALUES('Javier Fernandez','49099522L')

1 rows affected.

[]

In [19]:
%sql SELECT * FROM Hijos

Done.

[('Javier Fernandez', '49099522L')]

In [26]:
%%sql 
INSERT INTO Empleados VALUES('1sdsd2','60',500);
INSERT INTO Empleados VALUES('1fgf1','230',1500);
INSERT INTO Empleados VALUES('1asa2','54545',1500);

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [27]:
%%sql
SELECT * FROM Empleados;

Done.

[('49099522L', '606657670', 1000),
 ('12', '60', 500),
 ('11', '230', 1500),
 ('1sdsd2', '60', 500),
 ('1fgf1', '230', 1500),
 ('1asa2', '54545', 1500)]

In [31]:
%%sql 
INSERT INTO Hijos VALUES('Mary','1fgf1');

1 rows affected.

[]

In [34]:
%%sql
PRAGMA table_info(Departamentos);
INSERT INTO Departamentos VALUES(0,'Tecnologia',10000,'1asa2');
INSERT INTO Departamentos VALUES(123,'medicina',150000,'49099522L');

Done.
1 rows affected.
1 rows affected.

[]

In [36]:
%%sql
PRAGMA table_info(Trabaja_En);
INSERT INTO Trabaja_En VALUES('49099522L',0)

Done.
1 rows affected.

[]

In [43]:
%%sql
PRAGMA table_info(Empleados);
SELECT
2, nif
FROM Empleados
WHERE telefono = 60;

Done.
Done.

[(2, '12'), (2, '1sdsd2')]

In [45]:
%%sql
SELECT *
FROM Empleados
INNER JOIN Hijos
ON Empleados.nif = Hijos.nif

Done.

[('49099522L', '606657670', 1000, 'Javier Fernandez', '49099522L'),
 ('12', '60', 500, 'Jose', '12'),
 ('11', '230', 1500, 'Jose3', '11'),
 ('1fgf1', '230', 1500, 'Mary', '1fgf1')]